---
kind: enumMember
id: F:Autodesk.Revit.DB.Events.EventStatus.Cancelled
enum: Autodesk.Revit.DB.Events.EventStatus
source: html/b2db4f59-a798-a61b-9dd4-02dd6e9700f0.htm
---
# Autodesk.Revit.DB.Events.EventStatus.Cancelled

The action that triggered this event was cancelled by an event handler from the pre-event for the action.